import numpy as np


a = [[1, 2, 3], [4, 5, 6]]

b = [{'k1': x[0], 'k2': x[1], 'k3': x[2]} for x in np.array(a)]

print(b)


"""
# имеется список списков
a = [[1,2,3], [4,5,6]]
# Задание:
# сделать список словарей
b = [{'k1': 1, 'k2': 2, 'k3': 3}, {'k1': 4, 'k2': 5, 'k3': 6}]
# *написать решение в одну строку
"""